---
type: ReferenceArray
namespace: Autodesk.Revit.DB
version: 2024
members: 10
tags: [revit-api, class]
---

# ReferenceArray

`Autodesk.Revit.DB.ReferenceArray` · Revit 2024 · 10 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ReferenceArray | — | `public ReferenceArray ()` |
| Method | Append | — | `public virtual void Append ( Reference item )` |
| Method | Clear | — | `public virtual void Clear ()` |
| Method | ForwardIterator | — | `public virtual ReferenceArrayIterator ForwardIterator ()` |
| Method | GetEnumerator | — | `public virtual IEnumerator GetEnumerator ()` |
| Method | Insert | — | `public virtual void Insert ( Reference item , int index )` |
| Method | ReverseIterator | — | `public virtual ReferenceArrayIterator ReverseIterator ()` |
| Property | IsEmpty | — | `public virtual bool IsEmpty { get ; }` |
| Property | Item | — | `public virtual Reference this [ int index ] { get ; set ; }` |
| Property | Size | — | `public virtual int Size { get ; }` |